import { Module } from '@nestjs/common';
import { ConfigModule } from '@nestjs/config';

import { ArticlesModule } from './articles/articles.module';
import { CommentsModule } from './comments/comments.module';
import configuration from './configs/configuration';
import { UsersModule } from './users/users.module';

@Module({
  imports: [
    ConfigModule.forRoot({
      // forRoot() - метод, який налаштовує модуль конфігурації на глобальному рівні
      load: [configuration],
      // Функція configuration завантажує конфігураційні налаштування
      isGlobal: true,
      // Вказує, що цей модуль доступний глобально в застосунку,
      // тобто його не потрібно додатково імпортувати в інших модулях
    }),
    // ConfigModule — це вбудований модуль, який використовується
    // для керування конфігураційними параметрами додатку.
    // Він дозволяє легко завантажувати та використовувати налаштування з різних джерел,
    // наприклад, з файлів .env, з об'єктів конфігурації, або з інших джерел.
    // в нашому прикладі ми доступаємось до змінних розміщених у файлі configuration
    // (тобто, налаштувань різних параметрів, які можуть бути нами використані)
    ArticlesModule,
    UsersModule,
    CommentsModule,
  ],
})
export class AppModule {}
// клас AppModule, який позначений як модуль завдяки декоратору @Module.
// Він поєднує контролери і провайдери, які входять до складу програми
//Як працює цей модуль:
// AppController: це контролер, який обробляє HTTP-запити. Контролери містять маршрути (шляхи),
// які відповідають на запити від клієнтів.
// AppService: це провайдер, який містить бізнес-логіку програми.
// Контролер може використовувати цей сервіс для отримання або обробки даних.
// У результаті, AppModule — це основний модуль програми, який об'єднує контролер та сервіс,
// щоб забезпечити основний функціонал вашої NestJS програми.
